from fuzzywuzzy import process, fuzz

_text = 'fuck жопа Ж0па ж0пA Обсценная лексика Материал из Википедии — свободной энциклопедии В мультфильмах и комиксах обсценная лексика часто изображается заменой слов прочими символами Обсценная лексика (от лат. obscenus «непристойный, распутный, безнравственный»; также мат, нецензурная лексика, нецензурная брань, сквернословие) — табуированная (недопустимая) лексика, которую говорящие воспринимают как отталкивающую, непристойную. В это определение входят такие понятия, как кощунство, проклятия, брань, вульгаризмы, мат, эвфемизмы, дисфемизмы. Следует отличать обсценную лексику от ненормативной лексики, состав которой определяется набором социолектов (сленг, жаргон, арго, просторечия, диалекты), а также суржика, который является одним из видов стилистически сниженной лексики. Обсценная лексика является сегментом бранной лексики различных языков, включая неуважительные, угрожающие и бранные выражения. Использование любых видов ненормативной лексики имеет чёткие национальные, культурные и социальные признаки и существенно отличается в разных культурах и социальных группах. Каждое общество определяет отдельно, что относится к ненормативной лексике или ругани, и формулирует своё отношение к ней. Во многих странах мира существуют законы, ограничивающие использование обсценной лексики в публичной жизни и в СМИ. Обсценная лексика чаще употребляется в разговорной речи, чем в литературной[1]. Обсценная лексика не только является выражением эмоций. Она помогает выносить боль, преодолевать трудности, устанавливать доверие и выполняет другие важные для общества и индивида функции[2].'
t = set(_text.split())
t = _text.split()
l = {'obscenus', 'непристойный', 'распутный', 'безнравственный', 'жопа', 'FUCK'}


# p = process.extractOne('s', 't')
# cutoff=60
# p = process.extract('непристойный', l, score_cutoff=60)
# p = process.extractBests('непристойный', l, score_cutoff=80)
# p = process.extractOne('непристойный', l, score_cutoff=80)

def replace_character(word: str) -> str:
    s = {'!', '@', '#', '$', '%', '^', '&', '(', ')', '{', '}', '[', ']', '?', '<', '>'}
    return ''.join(['*' if c not in s else c for c in word])


s_c = 91
for i, w in enumerate(t):
    if process.extractOne(w, l, score_cutoff=s_c):
        print(process.extractOne(w, l, score_cutoff=s_c))
        print(t[i])
        t[i] = replace_character(t[i])
_text = ' '.join(t)
# print(t)

print(fuzz.WRatio('жопа', 'ж0пA'))

print(_text)

# print(p)
# help(process)
# for i, w in enumerate(t):
#
#     print(i, w)


# print(t)


# pass
# return result
